//
//  ContentView.swift
//  MoneyBox
//
//  Created by Чебупелина on 14.08.2023.
//

import SwiftUI

struct ContentView: View {
    var body: some View {
        NavigationView {
            VStack {
                
                NavigationLink(destination: BoxScreen(boxAttributes: BoxAttributes(name: "Test", description: "Какое-то длинное-длинное описание тестового экрана задач. Какое-то длинное-длинное описание тестового экрана задач. Какое-то длинное-длинное описание тестового экрана задач. Какое-то длинное-длинное описание тестового экрана задач. Какое-то длинное-длинное описание тестового экрана задач. Какое-то длинное-длинное описание тестового экрана задач. Какое-то длинное-длинное описание тестового экрана задач. Какое-то длинное-длинное описание тестового экрана задач. Какое-то длинное-длинное описание тестового экрана задач. Какое-то длинное-длинное описание тестового экрана задач. Какое-то длинное-длинное описание тестового экрана задач. Какое-то длинное-длинное описание тестового экрана задач. Какое-то длинное-длинное описание тестового экрана задач. Какое-то длинное-длинное описание тестового экрана задач. Какое-то длинное-длинное описание тестового экрана задач. Какое-то длинное-длинное описание тестового экрана задач. Какое-то длинное-длинное описание тестового экрана задач. Какое-то длинное-длинное описание тестового экрана задач. Какое-то длинное-длинное описание тестового экрана задач. Какое-то длинное-длинное описание тестового экрана задач. Какое-то длинное-длинное описание тестового экрана задач. Какое-то длинное-длинное описание тестового экрана задач. ", creationDate: Date(), income: [MoneyTransaction(name: "Что-то", value: 10, unit: .minute)], waste: [], finalValue: 20000))) {
                    Text("Tap")
                }
            }
            .padding()
        }
    }
}

struct ContentView_Previews: PreviewProvider {
    static var previews: some View {
        ContentView()
    }
}
